### 1. market.csv 파일 업로드

In [11]:
import csv

In [14]:
file = open('market.csv','r') # open 함수를 이용한 읽기 전용으로 불러오기
reader = csv.reader(file)

### 2. CSV 모듈 import

In [18]:
file = open('market.csv', 'r')
reader = csv.reader(file)

for row in reader: # reader에서 row(행) 가져오기.
    print(row) # 문자열 리스트: []로 묶인거 출력하는거

['id', 'name', 'price', 'amount']
['1', 'computer', '10000', '2']
['2', 'phone', '6000', '4']
['3', 'coffce', '3000', '8']
['4', 'apple', '4000', '3']
['5', 'pencil', '2000', '11']

In [1]:
import pandas as pd

In [3]:
market = pd.DataFrame({'ID': [ 1 , 2 , 3 , 4 , 5 ],
                             'name':['computer','phone','coffce','apple','pencil'],
                             'price' : [10000 , 6000 , 3000 , 4000 , 2000],
                      'amount' : [2, 4 , 8 , 3 ,11]})
market

   ID      name  price  amount
0   1  computer  10000       2
1   2     phone   6000       4
2   3    coffce   3000       8
3   4     apple   4000       3
4   5    pencil   2000      11

In [6]:
import os 
os.chdir("C:\\Users\\user\\Desktop\\파이썬")
os.getcwd()

'C:\\Users\\user\\Desktop\\파이썬'

In [ ]:
market.to_csv()

### 3. DF로 저장

In [21]:
import pandas as pd

In [26]:
df = pd.read_csv('market.csv') #pd를 이용하여 파일 불러오기
df

   id      name  price  amount
0   1  computer  10000       2
1   2     phone   6000       4
2   3    coffce   3000       8
3   4     apple   4000       3
4   5    pencil   2000      11

In [29]:
type(df)

pandas.core.frame.DataFrame

### 4. DF 정보 확인

In [32]:
df.info() 
len(df) # object 는 카테고리보다 용량이 크다

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      5 non-null      int64
 1   name    5 non-null      object
 2   price   5 non-null      int64
 3   amount  5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 288.0+ bytes

5

In [39]:
df.isnull().sum()

id        0
name      0
price     0
amount    0
dtype: int64

In [40]:
df.isnull()

      id   name  price  amount
0  False  False  False   False
1  False  False  False   False
2  False  False  False   False
3  False  False  False   False
4  False  False  False   False

In [41]:
df.describe()

             id        price     amount
count  5.000000      5.00000   5.000000
mean   3.000000   5000.00000   5.600000
std    1.581139   3162.27766   3.781534
min    1.000000   2000.00000   2.000000
25%    2.000000   3000.00000   3.000000
50%    3.000000   4000.00000   4.000000
75%    4.000000   6000.00000   8.000000
max    5.000000  10000.00000  11.000000

In [43]:
df1= df.drop(['id'], axis=1) # axis 행렬정하기 axis=0이면 행, axis=1이면 열
df1.describe()

             price     amount
count      5.00000   5.000000
mean    5000.00000   5.600000
std     3162.27766   3.781534
min     2000.00000   2.000000
25%     3000.00000   3.000000
50%     4000.00000   4.000000
75%     6000.00000   8.000000
max    10000.00000  11.000000

In [44]:
df1.to_csv('market2.csv') # csv 파일로 저장하기

### 5. list로 DF 만들기 (string -> object)
##### list : 가변형(mutable), 시퀀스(순서가 있음), [], 중복 허용, 가장 유용한 자료형

In [1]:
import pandas as pd
market_list = pd.DataFrame([[1, 'computer', 10000, 2],
                           [2, 'phone', 6000, 4],
                           [3, 'coffce', 3000, 8],
                           [4, 'apple', 4000, 3],
                           [5, 'pencil', 2000, 11]],
                           columns=['id','name','price','amount']) #[]갯수로 차원을 알 수 있음.

In [2]:
print(market_list) #라인없이 출력됨

   id      name  price  amount
0   1  computer  10000       2
1   2     phone   6000       4
2   3    coffce   3000       8
3   4     apple   4000       3
4   5    pencil   2000      11

### 6. dict로 DF 만들기
##### 딕셔너리(dict) : 가변형(mutable), 순서가 없음, 연관형 , {}
##### {key : value}, key는 반드시 불가변형, value는 가변, 불가변형 둘다 가능  ex) {ID : PW}

In [55]:
market_dict= pd.DataFrame({
    'id' : [1,2,3,4,5],
    'name' : ['computer','phone','coffce','apple','pencil'],
    'price' : [10000,6000,3000,4000,2000],
    'amount' : [2,4,8,3,11]
})
market_dict

   id      name  price  amount
0   1  computer  10000       2
1   2     phone   6000       4
2   3    coffce   3000       8
3   4     apple   4000       3
4   5    pencil   2000      11

In [56]:
df2= market_dict.copy() # df2에 그대로 복사

In [59]:
df2.head() # default 5개

   id      name  price  amount
0   1  computer  10000       2
1   2     phone   6000       4
2   3    coffce   3000       8
3   4     apple   4000       3
4   5    pencil   2000      11

In [61]:
df2.tail() # default 5개

   id      name  price  amount
0   1  computer  10000       2
1   2     phone   6000       4
2   3    coffce   3000       8
3   4     apple   4000       3
4   5    pencil   2000      11

In [62]:
df2.drop(['id'], axis=1) # 실제 df2데이터에서는 삭제되지 않음

       name  price  amount
0  computer  10000       2
1     phone   6000       4
2    coffce   3000       8
3     apple   4000       3
4    pencil   2000      11

In [65]:
df2.drop(['id'], axis=1, inplace=True) # inplace=True 를 입력함으로써 실제 데이터에서 삭제
df2

       name  price  amount
0  computer  10000       2
1     phone   6000       4
2    coffce   3000       8
3     apple   4000       3
4    pencil   2000      11

# 7. 필터링 : 조건 검색

### 비교연산자 
##### == : 같다
##### != : 다르다

### 논리연산자
##### &(and): 교집합
##### |(or): 합집합
##### ^(not): 여집합

In [68]:
df2[df2.name == 'apple'] # 동일하다는 뜻 , 일부분만 검색하면 출력x

    name  price  amount
3  apple   4000       3

In [71]:
df2[df2.amount >=5] # 읽을때 크거나(작거나) 같다.

     name  price  amount
2  coffce   3000       8
4  pencil   2000      11

In [78]:
df2[(df2.price >=2500) & (df2.amount>=5)]

     name  price  amount
2  coffce   3000       8

### 8. 인덱싱과 슬라이싱
##### 행 선택: loc, iloc 데이터 프레임 인덱싱하는 방법
##### loc[]: 인덱스(행-숫자 or 문자)기준-> 내가 지정한거
##### iloc[]: 행번호(시스템) 기준 -> 컴퓨터가 해준거

In [104]:
print(df2.loc[:]) # 전체 출력
print('\n') #프린트 사이에 간격 생기게 해줌
print(df2.loc[0]) # 첫번째 행만 추출
print('\n')
print(df2.loc[[1,3]]) # 2차원 내 특정 행을 출력하기 위해 대괄호 2개 사용
print('\n')
print(df2.loc[1:3]) # 특정 범위를 출력 []를 1번만 써도 됨
print('\n') 
print(df2.loc[1:3, ['price', 'amount']]) # 특정 행과 열 추출
print('\n')
print(df2.loc[0, 'name']) # 특정 하나의 셀만 출력
print('\n')
print(df2.loc[0,['name']])
print('\n')
print(df2.at[0,'name']) # at 함수: 특정 하나의 셀만 출력

       name  price  amount
0  computer  10000       2
1     phone   6000       4
2    coffce   3000       8
3     apple   4000       3
4    pencil   2000      11


name      computer
price        10000
amount           2
Name: 0, dtype: object


    name  price  amount
1  phone   6000       4
3  apple   4000       3


     name  price  amount
1   phone   6000       4
2  coffce   3000       8
3   apple   4000       3


   price  amount
1   6000       4
2   3000       8
3   4000       3


computer


name    computer
Name: 0, dtype: object


computer

In [113]:
print(df2.iloc[:]) # 전체 추출
print('\n')
print(df2.iloc[0]) # 첫번째 행 추출
print('\n')
print(df2.iloc[-1]) # 마지막 행 추출 
print('\n')
print(df2.iloc[1:3]) # .iloc[a:b]를 통해 출력할 경우, a~b-1번 까지의 행을 출력함.
print('\n') 
print(df2.iloc[1:3,1:3]) # 특정 행과 열을 가져오는데, 이때 iloc의 경우 숫자만 사용가능
print('\n')
print(df2.iloc[0,0])
print('\n')
print(df2.iat[0,0])

       name  price  amount
0  computer  10000       2
1     phone   6000       4
2    coffce   3000       8
3     apple   4000       3
4    pencil   2000      11


name      computer
price        10000
amount           2
Name: 0, dtype: object


name      pencil
price       2000
amount        11
Name: 4, dtype: object


     name  price  amount
1   phone   6000       4
2  coffce   3000       8


   price  amount
1   6000       4
2   3000       8


computer


computer

### 9. 파생변수 만들기 + 배열

In [114]:
df1

       name  price  amount
0  computer  10000       2
1     phone   6000       4
2    coffce   3000       8
3     apple   4000       3
4    pencil   2000      11

In [118]:
df1['total']=df1['price']*df1['amount']
df1
df1.dtypes

name      object
price      int64
amount     int64
total      int64
dtype: object

In [120]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   price   5 non-null      int64
 2   amount  5 non-null      int64
 3   total   5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 288.0+ bytes

In [121]:
type(df1.total) # 특정 변수의 데이터 타입만 알아보기

pandas.core.series.Series

In [123]:
df1.count() # count는 NaN 미포함

name      5
price     5
amount    5
total     5
dtype: int64

In [124]:
len(df1)

5

In [128]:
df1.size # size는 NaN 포함

20

In [135]:
df1.sum()

name      computerphonecoffceapplepencil
price                              25000
amount                                28
total                             102000
dtype: object

In [136]:
df1.sum(axis=0) # 열 주변 합

name      computerphonecoffceapplepencil
price                              25000
amount                                28
total                             102000
dtype: object

In [139]:
df1.sum(axis=1) # 행 주변 합

0    30002
1    30004
2    27008
3    16003
4    24011
dtype: int64

In [140]:
df1.isnull()

    name  price  amount  total
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False
3  False  False   False  False
4  False  False   False  False

In [141]:
df1.isnull().sum()

name      0
price     0
amount    0
total     0
dtype: int64

In [142]:
df1.index # 행의 속성

RangeIndex(start=0, stop=5, step=1)

In [143]:
df1.columns # 열의 속성

Index(['name', 'price', 'amount', 'total'], dtype='object')

In [148]:
b=df1.values
b # 배열(array)의 형태로 나타남.

array([['computer', 10000, 2, 20000],
       ['phone', 6000, 4, 24000],
       ['coffce', 3000, 8, 24000],
       ['apple', 4000, 3, 12000],
       ['pencil', 2000, 11, 22000]], dtype=object)

In [147]:
type(b)

numpy.ndarray

In [151]:
b = df1.to_numpy()
print(b)

[['computer' 10000 2 20000]
 ['phone' 6000 4 24000]
 ['coffce' 3000 8 24000]
 ['apple' 4000 3 12000]
 ['pencil' 2000 11 22000]]

numpy.ndarray

### 10. 배열의 형태로 DF 만들기

In [211]:
import numpy as np
import pandas as pd
c= pd.DataFrame(np.arange(1,17).reshape(4,4), columns=['a','b','c','d'])
c

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [167]:
df1.sort_values(by=['name'], axis=0) # by를 통해 기준 선정

       name  price  amount  total
3     apple   4000       3  12000
2    coffce   3000       8  24000
0  computer  10000       2  20000
4    pencil   2000      11  22000
1     phone   6000       4  24000

In [169]:
df1.sort_values(by=['total'], ascending=False) 
df1.sort_values(by=['total'],ascending=False

       name  price  amount  total
1     phone   6000       4  24000
2    coffce   3000       8  24000
4    pencil   2000      11  22000
0  computer  10000       2  20000
3     apple   4000       3  12000

In [174]:
df1.sort_values(by=['total', 'amount'], ascending=False)

       name  price  amount  total
2    coffce   3000       8  24000
1     phone   6000       4  24000
4    pencil   2000      11  22000
0  computer  10000       2  20000
3     apple   4000       3  12000

In [180]:
df1_t=df1.T # T: 전치시킬거에요.

In [181]:
df1_t.loc['score']=[5,3,4,2,1] # 행을 추가시킬때는 loc 사용
df1_t

               0      1       2      3       4
name    computer  phone  coffce  apple  pencil
price      10000   6000    3000   4000    2000
amount         2      4       8      3      11
total      20000  24000   24000  12000   22000
score          5      3       4      2       1

In [183]:
df1_t['5']=['note',1800,5,9000,4] # 열을 추가하려면 []쓰면 되는데, 데이터 유형은 기존과 동일하게 넣어야 함.
df1_t

               0      1       2      3       4     5
name    computer  phone  coffce  apple  pencil  note
price      10000   6000    3000   4000    2000  1800
amount         2      4       8      3      11     5
total      20000  24000   24000  12000   22000  9000
score          5      3       4      2       1     4

### 11. DF 합성:2개 이상의 DF를 하나로 합치는 방법
##### 1.데이터 병합(merge)- merge

In [185]:
import numpy as np
import pandas as pd

In [186]:
df1 =pd.DataFrame({
    '고객번호' : [1001,1002,1003,1004,1005,1006,1007],
    '이름' : ['둘리','도우너','또치','길동','희동','마이콜','영희']
}, columns=['고객번호','이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [189]:
df2 =pd.DataFrame({
    '고객번호': [1001,1001,1005,1006,1008,1001],
    '금액' : [10000,20000,15000,5000,10000,30000]
}, columns=['고객번호','금액'])
df2

   고객번호     금액
0  1001  10000
1  1001  20000
2  1005  15000
3  1006   5000
4  1008  10000
5  1001  30000

In [190]:
pd.merge(df1,df2) # how없으면 두개 데이터에서 공통된 열만 가져옴 (inner join)

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [192]:
pd.merge(df1,df2, how='outer') # how='outer'의 경우 두개의 DF의 모든 값을 불러오며, NaN이 생성될 수 있다. -> 외부조인(outer join방식)

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN
9  1008  NaN  10000.0

In [197]:
pd.merge(df1,df2, how='left') # how='left'의 경우, 왼쪽의 행을 기준으로 출력 되며, 왼쪽 행에 없는 행은 삭제

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [199]:
pd.merge(df1,df2,how='right') # how='right'의 경우, 오른쪽의 행을 기준으로 출력 되며, 오른쪽 행에 없는 행은 삭제

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000
5  1008  NaN  10000

### concat() 함수
##### 2.데이터 연결(concatenate) -concat
##### 기준 열(key columns)를 사용하지 않고 단순히 데이터를 연결
##### 기본적으로 위, 아래 데이터를 행으로 연결하며, 단순히 두 시리즈, DF를 연결하는것으로, 인덱스(행) 값 중복이 가능함.

In [202]:
s1= pd.Series([0,1], index= ['a','b'])
s2= pd.Series([2,3,4], index=['a','b','c'])

a    2
b    3
c    4
dtype: int64

In [203]:
s1

a    0
b    1
dtype: int64

In [204]:
s2

a    2
b    3
c    4
dtype: int64

In [205]:
pd.concat([s1,s2])

a    0
b    1
a    2
b    3
c    4
dtype: int64

In [206]:
df3= pd.DataFrame(np.arange(6).reshape(3,2),
                 index=['a','b','c'],
                 columns=['data1','data2'])
df3

   data1  data2
a      0      1
b      2      3
c      4      5

In [212]:
df4=pd.DataFrame(5+ np.arange(4).reshape(2,2),
                index=['a','b'],
                columns=['data3','data4'])
df4

   data3  data4
a      5      6
b      7      8

In [214]:
pd.concat([df3,df4], axis=1, sort=True) # sort는 정렬 해주는 함수 axis=1일 경우, 옆으로 붙음

   data1  data2  data3  data4
a      0      1    5.0    6.0
b      2      3    7.0    8.0
c      4      5    NaN    NaN

In [216]:
pd.concat([df3,df4], axis=0, sort=False) # axis= 0 일경우, 밑으로 붙음

   data1  data2  data3  data4
a    0.0    1.0    NaN    NaN
b    2.0    3.0    NaN    NaN
c    4.0    5.0    NaN    NaN
a    NaN    NaN    5.0    6.0
b    NaN    NaN    7.0    8.0

### 12. 피벗테이블: 데이터 열중에서 두개의 열을 각각 행과 열로 사용하여 교차테이블을 만듬
##### df.pivot(행,열,데이터로 사용할 열 이름)

In [220]:
data = {

'도시' : ['서울','서울','서울','부산','부산','부산','인천','인천'],

'연도' : ['2015','2010','2005','2015','2010','2005','2015','2010'],

'인구' : [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],

'지역' : ['수도권','수도권','수도권','경상권','경상권','경상권','수도권','수도권']

}

columns = ['도시','연도','인구','지역']

df5 = pd.DataFrame(data, columns=columns)

df5

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [235]:
df5.pivot('도시','연도','인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [243]:
df5.pivot(['지역','도시'],'연도','인구')

연도           2005       2010       2015
지역  도시
경상권 부산  3512547.0  3393191.0  3448737.0
수도권 서울  9762546.0  9631482.0  9904312.0
    인천        NaN   263203.0  2890451.0

In [234]:
df5.set_index(['지역','연도'])[['인구']]

               인구
지역  연도
수도권 2015  9904312
    2010  9631482
    2005  9762546
경상권 2015  3448737
    2010  3393191
    2005  3512547
수도권 2015  2890451
    2010   263203

In [226]:
df5.set_index(['도시','연도']) # 도시와 연도를 기준으로 인구와 지역이 나타남

              인구   지역
도시 연도
서울 2015  9904312  수도권
   2010  9631482  수도권
   2005  9762546  수도권
부산 2015  3448737  경상권
   2010  3393191  경상권
   2005  3512547  경상권
인천 2015  2890451  수도권
   2010   263203  수도권

In [227]:
df5.set_index(['도시','연도'])[['인구']] #도시와 연도를 기준으로 인구만 나타남

              인구
도시 연도
서울 2015  9904312
   2010  9631482
   2005  9762546
부산 2015  3448737
   2010  3393191
   2005  3512547
인천 2015  2890451
   2010   263203

In [225]:
df5.set_index(['도시','연도'])[['인구']].unstack() #행: 도시, 열:연도로 하여 인구를 표로 나타냄

           인구
연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0